# National Death Index
## Link https://www.cdc.gov/nchs/ndi/completion_status.htm
### Reference: http://pandas.pydata.org/pandas-docs/stable/dsintro.html

In [221]:
import pandas as pd
import numpy as np
import pivottablejs
import requests

In [222]:
df = pd.read_csv("NDI.csv")

In [223]:
df.head()

         Jurisdiction/State  % DemoData  %MedicalCauseData
0  2016 NATIONAL PERCENTAGE          97                 92
1                   Alabama         100                 97
2                    Alaska         100                 90
3                   Arizona         100                100
4                  Arkansas          99                 92

In [224]:
df['diff'] = df['% DemoData'] - df['%MedicalCauseData']
df.head()

         Jurisdiction/State  % DemoData  %MedicalCauseData  diff
0  2016 NATIONAL PERCENTAGE          97                 92     5
1                   Alabama         100                 97     3
2                    Alaska         100                 90    10
3                   Arizona         100                100     0
4                  Arkansas          99                 92     7

In [225]:
import pivottablejs
from pivottablejs import pivot_ui
pivot_ui(df)

In [187]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

  first_name last_name  age  preTestScore  postTestScore
0      Jason    Miller   42             4             25
1      Molly  Jacobson   52            24             94
2       Tina       Ali   36            31             57
3       Jake    Milner   24             2             62
4        Amy     Cooze   73             3             70

In [192]:
df['three'] = df['preTestScore'] * df['postTestScore']
# df['three'] = df['preTestScore']
df['flag'] = df['preTestScore'] - df['three'] 
df

#df['three'] = df['one'] * df['two']
#df['flag'] = df['one'] - df['two'] 
#df

  first_name last_name  age  preTestScore  postTestScore  three  flag
0      Jason    Miller   42             4             25    100   -96
1      Molly  Jacobson   52            24             94   2256 -2232
2       Tina       Ali   36            31             57   1767 -1736
3       Jake    Milner   24             2             62    124  -122
4        Amy     Cooze   73             3             70    210  -207

In [167]:
df = pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])],
                         orient='index', columns=['one', 'two', 'three'])
df

   one  two  three
A    1    2      3
B    4    5      6

In [186]:
df['one']

A    1
B    4
Name: one, dtype: int64

In [176]:
#df['one']
df['three'] = df['one'] * df['two']
df['flag'] = df['one'] - df['two'] 
df

   one  two  three  flag
A    1    2      2    -1
B    4    5     20    -1